geometries/naca2412/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }

    top
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform (1 0 0);
        value           uniform (1 0 0);
    }

    airfoil
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
